trinitrion/Tag_FW_EFR32xG22/firmware/oepl_hw_abstraction.c
  if(tagconfig->debug->type != DBG_SWO) {
    // Stop messing with the SWO pin as we may be reusing it somewhere else
    GPIO_DbgSWOEnable(false);
    GPIO_PinModeSet((GPIO_Port_TypeDef)GPIO_SWV_PORT, GPIO_SWV_PIN, gpioModeDisabled, 0);
  }

  if(tagconfig->debug->type != DBG_EUART) {
    // Turn off EUART when not in use to avoid it taking control over pins it shouldn't
    extern sl_iostream_uart_t *sl_iostream_uart_euart_debug_handle;
    sl_iostream_uart_deinit(sl_iostream_uart_euart_debug_handle);
  }

  // Set the requested debug print output
  switch(tagconfig->debug->type)
  {
    case DBG_SWO:
      sl_iostream_set_system_default(sl_iostream_instance_swo_info.handle);
      break;
    #if SL_CATALOG_IOSTREAM_RTT_PRESENT
    case DBG_RTT:
      sl_iostream_set_system_default(sl_iostream_instance_rtt_info.handle);
      break;
    #endif
    case DBG_EUART:
      // Adjust the pinout for the EUART
      GPIO_PinModeSet(tagconfig->debug->output.euart.tx.port, tagconfig->debug->output.euart.tx.pin, gpioModePushPull, 1);

      GPIO->EUARTROUTE->TXROUTE = (tagconfig->debug->output.euart.tx.port << _GPIO_EUART_TXROUTE_PORT_SHIFT)
                                | (tagconfig->debug->output.euart.tx.pin << _GPIO_EUART_TXROUTE_PIN_SHIFT);
      if(tagconfig->debug->output.euart.rx.port != gpioPortInvalid) {
        GPIO_PinModeSet(tagconfig->debug->output.euart.rx.port, tagconfig->debug->output.euart.rx.pin, gpioModeInput, 0);
        GPIO->EUARTROUTE->RXROUTE = (tagconfig->debug->output.euart.rx.port << _GPIO_EUART_RXROUTE_PORT_SHIFT)
                                  | (tagconfig->debug->output.euart.rx.pin << _GPIO_EUART_RXROUTE_PIN_SHIFT);
      }

      if(tagconfig->debug->output.euart.enable.port != gpioPortInvalid) {
        GPIO_PinModeSet(tagconfig->debug->output.euart.enable.port, tagconfig->debug->output.euart.enable.pin, gpioModePushPull, 1);
      }

      sl_iostream_set_system_default(sl_iostream_instance_euart_debug_info.handle);
      break;
    default:
      DPRINTF("Unrecognised debug output\n");
      while(1) {
        sl_power_manager_sleep();
      }
  }

  // Now that we have debug output, log a message if we're coming back from a HW error
  uint32_t resetCause = RMU_ResetCauseGet();
  RMU_ResetCauseClear();

  if (resetCause & EMU_RSTCAUSE_WDOG0) {
    DPRINTF("*** Rebooted due to catching a hardware fault ***\n");
  }

  CMU_ClockEnable(cmuClock_WDOG0, true);
  CMU_ClockSelectSet(cmuClock_WDOG0, cmuSelect_ULFRCO);

  // Setup flash
  if(tagconfig->hwtype == BRD4402B_WSTK ||
     tagconfig->hwtype == BRD4402B_WSTK_EPD ||
     tagconfig->hwtype == MODCHIP_HD150) {
    is_devkit = true;
    //oepl_hw_flash_deepsleep();
  }
  
  // Setup pins
  if(tagconfig->gpio) {
    if(tagconfig->gpio->button1.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->gpio->button1.port, tagconfig->gpio->button1.pin, gpioModeInputPullFilter, 1);
      button1_hwval = 0x80 | tagconfig->gpio->button1.port << 4| tagconfig->gpio->button1.pin;
    } else {
      button1_hwval = 0;
    }

    if(tagconfig->gpio->button2.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->gpio->button2.port, tagconfig->gpio->button2.pin, gpioModeInputPullFilter, 1);
      button2_hwval = 0x80 | tagconfig->gpio->button2.port << 4| tagconfig->gpio->button2.pin;
    } else {
      button2_hwval = 0;
    }

    if(tagconfig->gpio->gpio.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->gpio->gpio.port, tagconfig->gpio->gpio.pin, gpioModeInput, 1);
      gpio_hwval = 0x80 | tagconfig->gpio->gpio.port << 4 | tagconfig->gpio->gpio.pin;
    } else {
      gpio_hwval = 0;
    }

    if(tagconfig->gpio->nfc_fd.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->gpio->nfc_fd.port, tagconfig->gpio->nfc_fd.pin, gpioModeInput, 0);
      nfcfd_hwval = 0x80 | tagconfig->gpio->nfc_fd.port << 4| tagconfig->gpio->nfc_fd.pin;
    } else {
      nfcfd_hwval = 0;
    }

    nfcpwr_hwval = 0;
    nfcsda_hwval = 0;
  } else {
    button1_hwval = 0;
    button2_hwval = 0;
    gpio_hwval = 0;
    nfcfd_hwval = 0;
    nfcpwr_hwval = 0;
    nfcsda_hwval = 0;
  }

  // Setup led(s)
  if(tagconfig->led) {
    if(tagconfig->led->white.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->led->white.port, tagconfig->led->white.pin, gpioModePushPull, 1);
      white_hwval =  0x80 | tagconfig->led->white.port << 4| tagconfig->led->white.pin;
    } else {
      white_hwval = 0;
    }
    if(tagconfig->led->red.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->led->red.port, tagconfig->led->red.pin, gpioModePushPull, 1);
      red_hwval =  0x80 | tagconfig->led->red.port << 4| tagconfig->led->red.pin;
    } else {
      red_hwval = 0;
    }
    if(tagconfig->led->green.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->led->green.port, tagconfig->led->green.pin, gpioModePushPull, 1);
      green_hwval =  0x80 | tagconfig->led->green.port << 4| tagconfig->led->green.pin;
    } else {
      green_hwval = 0;
    }
    if(tagconfig->led->blue.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->led->blue.port, tagconfig->led->blue.pin, gpioModePushPull, 1);
      blue_hwval =  0x80 | tagconfig->led->blue.port << 4| tagconfig->led->blue.pin;
    } else {
      blue_hwval = 0;
    }
  } else {
    white_hwval = 0;
    red_hwval = 0;
    green_hwval = 0;
    blue_hwval = 0;
  }

  // Setup NFC is done ad-hoc since it may involve power up/down of the NFC chip
  if(tagconfig->nfc) {
    if(tagconfig->hwtype == SOLUM_AUTODETECT) {
      // All solum EFR32BG22 based tags seem to have TNB132M NFC chips which are undocumented.
      
      // Pending useful documentation of how to talk to it, let's just use the power output to
      // detect a field.

      GPIO_PinModeSet(tagconfig->nfc->SCL.port, tagconfig->nfc->SCL.pin, gpioModeWiredAndFilter, 0);
      GPIO_PinModeSet(tagconfig->nfc->SDA.port, tagconfig->nfc->SDA.pin, gpioModeWiredAndFilter, 0);

      GPIO_PinModeSet(tagconfig->nfc->power.port, tagconfig->nfc->power.pin, gpioModeWiredOrPullDown, 1);

      // Init sequence captured on HW
      sl_udelay_wait(40000);

      {
        // Use default settings
        I2C_Init_TypeDef i2cInit = I2C_INIT_DEFAULT;

        size_t i2cnum;
        switch((uint32_t)tagconfig->nfc->i2c) {
          #if defined(I2C0)
          case (uint32_t) I2C0:
            i2cnum = 0;
            CMU_ClockEnable(cmuClock_I2C0, true);
            break;
          #endif
          #if defined(I2C1)
          case (uint32_t) I2C1:
            i2cnum = 1;
            CMU_ClockEnable(cmuClock_I2C1, true);
            break;
          #endif
          #if defined(I2C2)
          case (uint32_t) I2C2:
            i2cnum = 2;
            CMU_ClockEnable(cmuClock_I2C2, true);
            break;
          #endif
          default:
            oepl_hw_crash(DBG_HW, false, "Unknown I2C peripheral\n");
            while(1);
        }

        // Route I2C pins to GPIO
        GPIO->I2CROUTE[i2cnum].SDAROUTE = (GPIO->I2CROUTE[0].SDAROUTE & ~_GPIO_I2C_SDAROUTE_MASK)
                              | (tagconfig->nfc->SDA.port << _GPIO_I2C_SDAROUTE_PORT_SHIFT
                              | (tagconfig->nfc->SDA.pin << _GPIO_I2C_SDAROUTE_PIN_SHIFT));
        GPIO->I2CROUTE[i2cnum].SCLROUTE = (GPIO->I2CROUTE[0].SCLROUTE & ~_GPIO_I2C_SCLROUTE_MASK)
                              | (tagconfig->nfc->SCL.port << _GPIO_I2C_SCLROUTE_PORT_SHIFT
                              | (tagconfig->nfc->SCL.pin << _GPIO_I2C_SCLROUTE_PIN_SHIFT));
        GPIO->I2CROUTE[i2cnum].ROUTEEN = GPIO_I2C_ROUTEEN_SDAPEN | GPIO_I2C_ROUTEEN_SCLPEN;

        // Initialize the I2C
        I2C_Init(tagconfig->nfc->i2c, &i2cInit);

        // Enable automatic STOP on NACK
        tagconfig->nfc->i2c->CTRL = I2C_CTRL_AUTOSN;
      }

      {
        // Transfer structure
        I2C_TransferSeq_TypeDef i2cTransfer;
        I2C_TransferReturn_TypeDef result;
        uint8_t txBuffer[2];

        txBuffer[0] = 0x21;
        txBuffer[1] = 0x04;

        // Initialize I2C transfer
        i2cTransfer.addr          = 0x30 << 1;
        i2cTransfer.flags         = I2C_FLAG_WRITE;
        i2cTransfer.buf[0].data   = txBuffer;
        i2cTransfer.buf[0].len    = 2;
        i2cTransfer.buf[1].data   = NULL;
        i2cTransfer.buf[1].len    = 0;

        result = I2C_TransferInit(I2C0, &i2cTransfer);

