trinitrion/Tag_FW_EFR32xG22/firmware/oepl_hw_abstraction.c
        // Send data
        while (result == i2cTransferInProgress) {
          result = I2C_Transfer(I2C0);
        }

        if (result != i2cTransferDone) {
          DPRINTF("I2C fail %08x\n", result);
        }
      }

      {
        // Transfer structure
        I2C_TransferSeq_TypeDef i2cTransfer;
        I2C_TransferReturn_TypeDef result;
        uint8_t txBuffer[1 + 1];

        txBuffer[0] = 0x25;
        txBuffer[1] = 0x00;

        // Initialize I2C transfer
        i2cTransfer.addr          = 0x30 << 1;
        i2cTransfer.flags         = I2C_FLAG_WRITE_READ;
        i2cTransfer.buf[0].data   = txBuffer;
        i2cTransfer.buf[0].len    = 1;
        i2cTransfer.buf[1].data   = &txBuffer[1];
        i2cTransfer.buf[1].len    = 1;

        result = I2C_TransferInit(I2C0, &i2cTransfer);

        // Send data
        while (result == i2cTransferInProgress) {
          result = I2C_Transfer(I2C0);
        }

        if (result != i2cTransferDone) {
           DPRINTF("I2C fail %08x\n", result);
        } else {
          DPRINTF("I2C Response %02x\n", txBuffer[1]);
        }
      }

      sl_udelay_wait(20000);

      {
        // Transfer structure
        I2C_TransferSeq_TypeDef i2cTransfer;
        I2C_TransferReturn_TypeDef result;
        uint8_t txBuffer[1 + 16];

        txBuffer[0] = 0x30;

        // Initialize I2C transfer
        i2cTransfer.addr          = 0x43 << 1;
        i2cTransfer.flags         = I2C_FLAG_WRITE_READ;
        i2cTransfer.buf[0].data   = txBuffer;
        i2cTransfer.buf[0].len    = 1;
        i2cTransfer.buf[1].data   = txBuffer;
        i2cTransfer.buf[1].len    = 16;

        result = I2C_TransferInit(I2C0, &i2cTransfer);

        // Send data
        while (result == i2cTransferInProgress) {
          result = I2C_Transfer(I2C0);
        }

        if (result != i2cTransferDone) {
           DPRINTF("I2C fail %08x\n", result);
        } else {
          DPRINTF("I2C Response: ");
          for(size_t i = 0; i < sizeof(txBuffer) - 1; i++) {
            DPRINTF("%02x ", txBuffer[1+i]);
          }
        }
      }

      sl_udelay_wait(20000);

      {
        // Transfer structure
        I2C_TransferSeq_TypeDef i2cTransfer;
        I2C_TransferReturn_TypeDef result;
        uint8_t txBuffer[2];

        txBuffer[0] = 0x21;
        txBuffer[1] = 0x01;

        // Initialize I2C transfer
        i2cTransfer.addr          = 0x30 << 1;
        i2cTransfer.flags         = I2C_FLAG_WRITE;
        i2cTransfer.buf[0].data   = txBuffer;
        i2cTransfer.buf[0].len    = 2;
        i2cTransfer.buf[1].data   = NULL;
        i2cTransfer.buf[1].len    = 0;

        result = I2C_TransferInit(I2C0, &i2cTransfer);

        // Send data
        while (result == i2cTransferInProgress) {
          result = I2C_Transfer(I2C0);
        }

        if (result != i2cTransferDone) {
           DPRINTF("I2C fail %08x\n", result);
        }
      }

      sl_udelay_wait(14000);

      // Turn it off
      GPIO_PinOutClear(tagconfig->nfc->power.port, tagconfig->nfc->power.pin);
      GPIO_PinModeSet(tagconfig->nfc->SCL.port, tagconfig->nfc->SCL.pin, gpioModeInput, 1);
      GPIO_PinModeSet(tagconfig->nfc->SDA.port, tagconfig->nfc->SDA.pin, gpioModeInput, 1);

      GPIO_PinModeSet(tagconfig->nfc->power.port, tagconfig->nfc->power.pin, gpioModeInput, 1);

      nfcpwr_hwval = 0x80 | (tagconfig->nfc->power.port << 4) | tagconfig->nfc->power.pin;
      nfcsda_hwval = 0x80 | (tagconfig->nfc->SDA.port << 4) | tagconfig->nfc->SDA.pin;
    }
  }

  // Setup power manager infrastructure
  sl_power_manager_subscribe_em_transition_event(&event_handle, &event_info);

  // Setup application NVM
  oepl_nvm_status_t status = oepl_nvm_init_default();
  if(status == NVM_ERROR) {
    // Clean our slate
    DPRINTF("Need to autodetect, lost NVM\n");
    oepl_nvm_factory_reset(oepl_efr32xg22_get_oepl_hwid());
  }

  if(oepl_nvm_setting_get(OEPL_HWID, &hwid, sizeof(hwid)) != NVM_SUCCESS) {
    // Clean our slate
    DPRINTF("Need to autodetect, lost NVM\n");
    oepl_nvm_factory_reset(oepl_efr32xg22_get_oepl_hwid());
  }

  // Cache our HWID
  oepl_nvm_setting_get(OEPL_HWID, &hwid, sizeof(hwid));
  DPRINTF("Hello OEPL tag type 0x%02x\n", hwid);

  size_t slots, slot_size;
  oepl_nvm_get_num_img_slots(&slots, &slot_size);
  DPRINTF("Have %d image slots of %d bytes\n", slots, slot_size);

  // Setup display
  oepl_efr32xg22_displayparams_t displayconfig;
  bool is_valid = oepl_efr32xg22_get_displayparams(&displayconfig);
  if(!is_valid) {
    DPRINTF("Error: no valid display configuration\n");
    while(1) {
      sl_power_manager_sleep();
    }
  }

  oepl_display_init(&displayconfig);
}

void oepl_hw_set_led(uint8_t color, bool on)
{
  if(red_hwval || green_hwval || blue_hwval) {
    // todo: color support using PWM on a timer
    (void) color;
    if(on) {
      if(color & 0b11100000)
      GPIO_PinOutClear((red_hwval & 0x70) >> 4, red_hwval & 0x0F);
      if(color & 0b00011100)
      GPIO_PinOutClear((green_hwval & 0x70) >> 4, green_hwval & 0x0F);
      if(color & 0b00000011)
      GPIO_PinOutClear((blue_hwval & 0x70) >> 4, blue_hwval & 0x0F);
    } else {
      if(color & 0b11100000)
      GPIO_PinOutSet((red_hwval & 0x70) >> 4, red_hwval & 0x0F);
      if(color & 0b00011100)
      GPIO_PinOutSet((green_hwval & 0x70) >> 4, green_hwval & 0x0F);
      if(color & 0b00000011)
      GPIO_PinOutSet((blue_hwval & 0x70) >> 4, blue_hwval & 0x0F);
    }
  } else if(white_hwval) {
    if(on) {
      GPIO_PinOutClear((white_hwval & 0x70) >> 4, white_hwval & 0x0F);
    } else {
      GPIO_PinOutSet((white_hwval & 0x70) >> 4, white_hwval & 0x0F);
    }
  }
}

static void gpioint_cb(uint8_t pin, void* ctx)
{
  if(ctx == NULL) {
    return;
  }

  if(button1_hwval && (pin == (button1_hwval & 0xF))) {
    ((oepl_hw_gpio_cb_t)ctx)(BUTTON_1, RISING);
  }
  if(button2_hwval && (pin == (button2_hwval & 0xF))) {
    ((oepl_hw_gpio_cb_t)ctx)(BUTTON_2, RISING);
  }
  if(gpio_hwval && (pin == (gpio_hwval & 0xF))) {
    ((oepl_hw_gpio_cb_t)ctx)(GENERIC_GPIO, RISING);
  }
  if(nfcfd_hwval && (pin == (nfcfd_hwval & 0xF))) {
    ((oepl_hw_gpio_cb_t)ctx)(NFC_WAKE, RISING);
  }
}

void oepl_hw_init_gpio(oepl_hw_gpio_cb_t cb)
{
  gpio_cb = cb;
  if(button1_hwval) {
    unsigned int interrupt = GPIOINT_CallbackRegisterExt(
      button1_hwval & 0xF,
      gpioint_cb,
      cb);
    GPIO_ExtIntConfig((button1_hwval & 0x70) >> 4,
                      button1_hwval & 0xF,
                      interrupt,
                      true,
                      false,
                      true);
    GPIO_IntClear(1<<(button1_hwval & 0xF));
    GPIO_IntEnable(1<<(button1_hwval & 0xF));
    DPRINTF("Registered interrupt on pin %d for Button 1\n", (button1_hwval & 0xF));
  }

  if(button2_hwval) {
    unsigned int interrupt = GPIOINT_CallbackRegisterExt(
      button2_hwval & 0xF,
      gpioint_cb,
      cb);
    GPIO_ExtIntConfig((button2_hwval & 0x70) >> 4,
                      button2_hwval & 0xF,
                      interrupt,
                      true,
                      false,
                      true);
    GPIO_IntClear(1<<(button2_hwval & 0xF));
    GPIO_IntEnable(1<<(button2_hwval & 0xF));
    DPRINTF("Registered interrupt on pin %d for Button 2\n", (button2_hwval & 0xF));
  }

  if(gpio_hwval) {
    unsigned int interrupt = GPIOINT_CallbackRegisterExt(
      gpio_hwval & 0xF,
      gpioint_cb,
      cb);
    GPIO_ExtIntConfig((gpio_hwval & 0x70) >> 4,
                      gpio_hwval & 0xF,
                      interrupt,
                      true,
                      false,
                      true);
    GPIO_IntClear(1<<(gpio_hwval & 0xF));
    GPIO_IntEnable(1<<(gpio_hwval & 0xF));
    DPRINTF("Registered interrupt on pin %d for GPIO\n", (gpio_hwval & 0xF));
  }

