trinitrion/Tag_FW_EFR32xG22/firmware/oepl_hw_abstraction.c
  if(nfcfd_hwval) {
    unsigned int interrupt = GPIOINT_CallbackRegisterExt(
      nfcfd_hwval & 0xF,
      gpioint_cb,
      cb);
    GPIO_ExtIntConfig((nfcfd_hwval & 0x70) >> 4,
                      nfcfd_hwval & 0xF,
                      interrupt,
                      true,
                      false,
                      true);
    GPIO_IntClear(1<<(nfcfd_hwval & 0xF));
    GPIO_IntEnable(1<<(nfcfd_hwval & 0xF));
    DPRINTF("Registered interrupt on pin %d for NFC field detect\n", (nfcfd_hwval & 0xF));
  }
}

bool oepl_hw_get_temperature(int8_t* temperature_degc)
{
  *temperature_degc = (int8_t)EMU_TemperatureGet();
  //EMU->CTRL &= ~EMU_CTRL_EM2DBGEN;
  return true;
}

bool oepl_hw_get_voltage(uint16_t* voltage_mv, bool force_measurement)
{
  static uint32_t last_measurement_ticks = 0;
  static uint16_t voltage_reading_cache = 0;

  if(force_measurement
     || sl_sleeptimer_tick_to_ms(sl_sleeptimer_get_tick_count() - last_measurement_ticks) > 60*60*1000
     || voltage_reading_cache == 0) {
    // Declare init structs
    IADC_Init_t init = IADC_INIT_DEFAULT;
    IADC_AllConfigs_t initAllConfigs = IADC_ALLCONFIGS_DEFAULT;
    IADC_InitSingle_t initSingle = IADC_INITSINGLE_DEFAULT;
    IADC_SingleInput_t initSingleInput = IADC_SINGLEINPUT_DEFAULT;

    // Enable IADC0 clock
    CMU_ClockEnable(cmuClock_IADC0, true);
    
    // Reset IADC to reset configuration in case it has been modified by
    // other code
    IADC_reset(IADC0);

    // Select clock for IADC
    CMU_ClockSelectSet(cmuClock_IADCCLK, cmuSelect_FSRCO);  // FSRCO - 20MHz

    // Modify init structs and initialize
    init.warmup = iadcWarmupNormal;

    // Set the HFSCLK prescale value here
    init.srcClkPrescale = IADC_calcSrcClkPrescale(IADC0, 20000000, 0);

    // Configuration 0 is used by both scan and single conversions by default
    // Use internal bandgap (supply voltage in mV) as reference
    initAllConfigs.configs[0].reference = iadcCfgReferenceInt1V2;
    initAllConfigs.configs[0].vRef = 1210;
    initAllConfigs.configs[0].osrHighSpeed = iadcCfgOsrHighSpeed2x;
    initAllConfigs.configs[0].analogGain = iadcCfgAnalogGain1x;

    // Divides CLK_SRC_ADC to set the CLK_ADC frequency
    initAllConfigs.configs[0].adcClkPrescale = IADC_calcAdcClkPrescale(IADC0,
                                              10000000,
                                              0,
                                              iadcCfgModeNormal,
                                              init.srcClkPrescale);

    // Assign pins to positive and negative inputs in differential mode
    initSingleInput.posInput   = iadcPosInputAvdd;
    initSingleInput.negInput   = iadcNegInputGnd;

    // Initialize the IADC
    IADC_init(IADC0, &init, &initAllConfigs);

    // Initialize the Single conversion inputs
    IADC_initSingle(IADC0, &initSingle, &initSingleInput);

    // Start IADC conversion
    IADC_command(IADC0, iadcCmdStartSingle);

    // Wait for conversion to be complete
    while((IADC0->STATUS & (_IADC_STATUS_CONVERTING_MASK
                | _IADC_STATUS_SINGLEFIFODV_MASK)) != IADC_STATUS_SINGLEFIFODV);

    // Get ADC result
    uint32_t sample = IADC_pullSingleFifoResult(IADC0).data;
    voltage_reading_cache = ((sample * 4 * 1200) / 4095);

    IADC_command(IADC0, iadcCmdStopSingle);
    IADC_reset(IADC0);
    CMU_ClockEnable(cmuClock_IADC0, false);
    
    last_measurement_ticks = sl_sleeptimer_get_tick_count();
    DPRINTF("Supply voltage %d mv\n", voltage_reading_cache);

    uint16_t lowbat_voltage;
    if(oepl_nvm_setting_get(OEPL_LOWBAT_VOLTAGE_MV, &lowbat_voltage, sizeof(lowbat_voltage)) == NVM_SUCCESS) {
      if(voltage_reading_cache <= lowbat_voltage) {
        oepl_display_set_overlay(ICON_LOW_BATTERY, true);
      } else {
        oepl_display_set_overlay(ICON_LOW_BATTERY, false);
      }
    }
  }
  *voltage_mv = voltage_reading_cache;
  return true;
}

uint8_t oepl_hw_get_hwid(void)
{
  return hwid;
}

uint8_t oepl_hw_get_capabilities(void)
{
  return oepl_efr32xg22_get_oepl_hwcapa(); 
}

uint16_t oepl_hw_get_swversion(void)
{
  extern char linker_vectors_begin;
  void** vtable = (void*)(&linker_vectors_begin);

  ApplicationProperties_t* appinfo_p = (ApplicationProperties_t*)vtable[13];
  if(appinfo_p != NULL) {
    return appinfo_p->app.version;
  } else {
    return SL_APPLICATION_VERSION;
  }
}

const char* oepl_hw_get_swsuffix(void)
{
#if defined(GIT_COMMIT_ID)
  return GIT_COMMIT_ID;
#else
  return "Dev";
#endif
}

// -----------------------------------------------------------------------------
//                    TNB132M NFC write support (3ALogics, undocumented)
// -----------------------------------------------------------------------------
// Ported from OpenDisplay/Firmware_Silabs (opendisplay_ble.c, od_nfc_* family:
// od_nfc_tnb132m_prime_type3(), od_nfc_type3_paged_block_read16/write16(),
// od_nfc_write_ndef_text_en(), od_nfc_init_sequence()), used with the original
// author's permission. Their version bit-bangs SCL/SDA with GPIO; this port
// uses the EFR32's hardware I2C peripheral instead (same peripheral/pins our
// existing boot-time TNB132M capture sequence below already drives), the
// wire-level protocol and register map are otherwise unchanged.
//
// Reverse-engineered I2C map (no public TNB132M datasheet):
//   dev 0x30 sub 0x21/0x25  = control/prime registers (see the boot-time
//                             capture a few hundred lines up in this file)
//   dev 0x43 sub 0x30       = status/ID readback, part of the same prime step
//   dev 0x48 sub 0x00       = Type-3 Attribute Information (AI) block:
//                             Ver | Nbr | Nbw | Nmaxb | rsv[4] | WriteFlag |
//                             RWFlag | Ln[3] | Checksum[2]
//   dev 0x40 sub 0x10,0x20  = Type-3 NDEF message data, byte-offset addressed
//                             16 bytes ("block") at a time
// The tag only caches AI + Nbr data blocks per "anchor" (a fresh dev 0x48
// sub 0x00 read); on our samples Nbr=2, so a full NDEF message (this driver
// writes no TLV wrapper, just the raw NDEF message bytes + Ln) is capped at
// 2*16 = 32 bytes. That 32-byte ceiling is also the exact boundary OpenDisplay
// verified on hardware (a 25-character Well-Known-Text record: 4B record
// header + 3B type/lang + 25B text = 32B).
//
// HW-TESTED ON THIS FORK, 2026-09-10, RESULT: NOT WORKING YET.
// Tested oepl_hw_nfc_write_url() end-to-end on a real EL016F5C4C tag (via the
// AP's "Set NFC URL" content card -> DATATYPE_NFC_URL_DIRECT ->
// application_process_nfcu_block() in oepl_app.c -> this code): the block is
// received, MD5-checked and applied (AP-side updatecount/hash advance) and
// the tag keeps checking in normally afterward -- so this code path runs to
// completion without crashing or destabilizing the tag. BUT the chip is not
// then readable as an NFC Forum tag: NXP TagInfo only identifies it at the
// raw IC level ("FeliCa, 6KB EEPROM"), and "NFC Tools" (which actively polls
// for Type-3/FeliCa NDEF, not just iOS's passive background tag reader)
// reads nothing at all. So whatever we're writing isn't being exposed as a
// valid Type-3 NDEF service over RF -- either the I2C write itself is
// silently failing (application_process_nfcu_block() never checks this
// function's return value before recording the update as applied, so a
// silent I2C NACK here would look identical to what we observed), or the AI
// block we construct (Ver/Nbr/Nbw/Nmaxb/checksum) doesn't satisfy whatever
// the chip's own RF-side firmware needs to advertise NDEF/System Code 0x12FC
// -- that RF-facing behavior is entirely internal to the TNB132M and invisible
// over the I2C map we've reverse-engineered.
// NEXT STEP before trusting this code at all: get a UART debug log
// (DPRINTF output over the debugconfig_solum EUART pins) from an actual
// write attempt, to see whether tnb132m_i2c_write16()/tnb132m_i2c_read16()
// are reporting success or failure -- we have no evidence either way yet.
// oepl_hw_nfc_write_raw() (Text-record framing, matching OpenDisplay's
// actual verified reference) has NOT been separately hardware-tested since
// the AP UI only exposes a URL content card, not a raw-NDEF one; given
// write_url()'s failure above, don't assume it fares any better untested.
// ALSO NOT IMPLEMENTED: nonblocking operation (both entry points block for
// the ~100ms of the full power-up/prime/write/power-down cycle, same as the
// boot-time capture sequence below already does) and URI abbreviation codes
// (oepl_hw_nfc_write_url() always uses identifier code 0x00, i.e. a literal
// non-abbreviated URI -- correct, just not the most compact encoding).

#define TNB132M_MAX_NDEF_LEN 32u
// Bounded iteration count for the I2C_Transfer() poll loop in
// tnb132m_i2c_transfer(): this code is reachable at runtime from AP-supplied
// data (see application_process_nfcu_block()/nfcr_block() in oepl_app.c),
// not just once at boot, so an unresponsive/removed TNB132M or a stuck bus
// must not be able to hang the tag indefinitely -- bail out and let the
// caller treat it as a failed write instead of spinning forever.
#define TNB132M_I2C_MAX_POLL_ITERS 100000u

