trinitrion/Tag_FW_EFR32xG22/firmware/oepl_hw_abstraction.c
// Single bounded-wait point every TNB132M I2C transfer below goes through.
static I2C_TransferReturn_TypeDef tnb132m_i2c_transfer(I2C_TypeDef* i2c, I2C_TransferSeq_TypeDef* seq)
{
  I2C_TransferReturn_TypeDef result = I2C_TransferInit(i2c, seq);
  uint32_t iters = 0;
  while(result == i2cTransferInProgress && iters < TNB132M_I2C_MAX_POLL_ITERS) {
    result = I2C_Transfer(i2c);
    iters++;
  }
  if(result == i2cTransferInProgress) {
    DPRINTF("NFC I2C transfer timed out\n");
    return i2cTransferUsageFault;
  }
  return result;
}

static bool tnb132m_i2c_write16(const oepl_efr32xg22_nfcconfig_t* nfc, uint8_t dev7, uint8_t sub, const uint8_t* in16)
{
  I2C_TransferSeq_TypeDef i2cTransfer;
  uint8_t txBuffer[1 + 16];

  txBuffer[0] = sub;
  memcpy(&txBuffer[1], in16, 16);

  i2cTransfer.addr        = (uint16_t)(dev7 << 1);
  i2cTransfer.flags       = I2C_FLAG_WRITE;
  i2cTransfer.buf[0].data = txBuffer;
  i2cTransfer.buf[0].len  = sizeof(txBuffer);
  i2cTransfer.buf[1].data = NULL;
  i2cTransfer.buf[1].len  = 0;

  if(tnb132m_i2c_transfer(nfc->i2c, &i2cTransfer) != i2cTransferDone) {
    DPRINTF("NFC I2C write dev=%02x sub=%02x failed\n", dev7, sub);
    return false;
  }
  return true;
}

static bool tnb132m_i2c_read16(const oepl_efr32xg22_nfcconfig_t* nfc, uint8_t dev7, uint8_t sub, uint8_t* out16)
{
  I2C_TransferSeq_TypeDef i2cTransfer;
  uint8_t subByte = sub;

  i2cTransfer.addr        = (uint16_t)(dev7 << 1);
  i2cTransfer.flags       = I2C_FLAG_WRITE_READ;
  i2cTransfer.buf[0].data = &subByte;
  i2cTransfer.buf[0].len  = 1;
  i2cTransfer.buf[1].data = out16;
  i2cTransfer.buf[1].len  = 16;

  if(tnb132m_i2c_transfer(nfc->i2c, &i2cTransfer) != i2cTransferDone) {
    DPRINTF("NFC I2C read dev=%02x sub=%02x failed\n", dev7, sub);
    return false;
  }
  return true;
}

// Prime/finalize control writes are 1-2 bytes to dev 0x30, too small to
// reuse the 16-byte block helpers above -- two more tiny wrappers around the
// shared tnb132m_i2c_transfer() instead of hand-rolling I2C_TransferSeq_TypeDef
// a third and fourth time.
static bool tnb132m_i2c_write_reg(const oepl_efr32xg22_nfcconfig_t* nfc, uint8_t dev7, uint8_t reg, uint8_t val)
{
  uint8_t txBuffer[2] = {reg, val};
  I2C_TransferSeq_TypeDef i2cTransfer;

  i2cTransfer.addr        = (uint16_t)(dev7 << 1);
  i2cTransfer.flags       = I2C_FLAG_WRITE;
  i2cTransfer.buf[0].data = txBuffer;
  i2cTransfer.buf[0].len  = sizeof(txBuffer);
  i2cTransfer.buf[1].data = NULL;
  i2cTransfer.buf[1].len  = 0;

  if(tnb132m_i2c_transfer(nfc->i2c, &i2cTransfer) != i2cTransferDone) {
    DPRINTF("NFC I2C write dev=%02x reg=%02x failed\n", dev7, reg);
    return false;
  }
  return true;
}

static bool tnb132m_i2c_write_then_read_reg(const oepl_efr32xg22_nfcconfig_t* nfc, uint8_t dev7, uint8_t reg, uint8_t* out)
{
  uint8_t regByte = reg;
  I2C_TransferSeq_TypeDef i2cTransfer;

  i2cTransfer.addr        = (uint16_t)(dev7 << 1);
  i2cTransfer.flags       = I2C_FLAG_WRITE_READ;
  i2cTransfer.buf[0].data = &regByte;
  i2cTransfer.buf[0].len  = 1;
  i2cTransfer.buf[1].data = out;
  i2cTransfer.buf[1].len  = 1;

  if(tnb132m_i2c_transfer(nfc->i2c, &i2cTransfer) != i2cTransferDone) {
    DPRINTF("NFC I2C write+read dev=%02x reg=%02x failed\n", dev7, reg);
    return false;
  }
  return true;
}

// Power up the TNB132M and run od_nfc_tnb132m_prime_type3(): wakes the host
// I2C interface and opens the byte-offset Type-3 data window at dev 0x40.
// Mirrors the boot-time capture sequence above (same delays/registers) --
// NOTE: that boot-time sequence hardcodes I2C0/GPIO->I2CROUTE[0] regardless
// of tagconfig->nfc->i2c, while this copy parameterizes correctly on
// nfc->i2c/i2cnum. Harmless today since every board we support still wires
// NFC to I2C0, but the two copies will drift if that ever changes. Left the
// boot-time copy as-is rather than refactored, to keep this port's diff
// scoped to the write path.
static bool tnb132m_power_up_and_prime(const oepl_efr32xg22_tagconfig_t* tagcfg)
{
  const oepl_efr32xg22_nfcconfig_t* nfc = tagcfg->nfc;

  GPIO_PinModeSet(nfc->SCL.port, nfc->SCL.pin, gpioModeWiredAndFilter, 0);
  GPIO_PinModeSet(nfc->SDA.port, nfc->SDA.pin, gpioModeWiredAndFilter, 0);
  GPIO_PinModeSet(nfc->power.port, nfc->power.pin, gpioModeWiredOrPullDown, 1);

  sl_udelay_wait(40000);

  {
    I2C_Init_TypeDef i2cInit = I2C_INIT_DEFAULT;
    size_t i2cnum;
    switch((uint32_t) nfc->i2c) {
      #if defined(I2C0)
      case (uint32_t) I2C0:
        i2cnum = 0;
        CMU_ClockEnable(cmuClock_I2C0, true);
        break;
      #endif
      #if defined(I2C1)
      case (uint32_t) I2C1:
        i2cnum = 1;
        CMU_ClockEnable(cmuClock_I2C1, true);
        break;
      #endif
      #if defined(I2C2)
      case (uint32_t) I2C2:
        i2cnum = 2;
        CMU_ClockEnable(cmuClock_I2C2, true);
        break;
      #endif
      default:
        DPRINTF("NFC: unknown I2C peripheral\n");
        return false;
    }

    GPIO->I2CROUTE[i2cnum].SDAROUTE = (GPIO->I2CROUTE[i2cnum].SDAROUTE & ~_GPIO_I2C_SDAROUTE_MASK)
                          | (nfc->SDA.port << _GPIO_I2C_SDAROUTE_PORT_SHIFT
                          | (nfc->SDA.pin << _GPIO_I2C_SDAROUTE_PIN_SHIFT));
    GPIO->I2CROUTE[i2cnum].SCLROUTE = (GPIO->I2CROUTE[i2cnum].SCLROUTE & ~_GPIO_I2C_SCLROUTE_MASK)
                          | (nfc->SCL.port << _GPIO_I2C_SCLROUTE_PORT_SHIFT
                          | (nfc->SCL.pin << _GPIO_I2C_SCLROUTE_PIN_SHIFT));
    GPIO->I2CROUTE[i2cnum].ROUTEEN = GPIO_I2C_ROUTEEN_SDAPEN | GPIO_I2C_ROUTEEN_SCLPEN;

    I2C_Init(nfc->i2c, &i2cInit);
    nfc->i2c->CTRL = I2C_CTRL_AUTOSN;
  }

  if(!tnb132m_i2c_write_reg(nfc, 0x30, 0x21, 0x04)) {
    DPRINTF("NFC prime step 1 failed\n");
    return false;
  }

  {
    uint8_t discard;
    if(!tnb132m_i2c_write_then_read_reg(nfc, 0x30, 0x25, &discard)) {
      DPRINTF("NFC prime step 2 failed\n");
      return false;
    }
  }

  sl_udelay_wait(20000);

  {
    uint8_t out16[16];
    if(!tnb132m_i2c_read16(nfc, 0x43, 0x30, out16)) {
      DPRINTF("NFC prime step 3 failed\n");
      return false;
    }
  }

