trinitrion/Tag_FW_EFR32xG22/firmware/oepl_hw_abstraction.c
  return true;
}

// od_nfc_init_sequence()'s trailing "0x21=0x01" write plus power-down. Always
// called (even on a failed prime/write) so we never leave the chip powered.
static void tnb132m_finalize_and_power_down(const oepl_efr32xg22_tagconfig_t* tagcfg)
{
  const oepl_efr32xg22_nfcconfig_t* nfc = tagcfg->nfc;

  sl_udelay_wait(20000);

  if(!tnb132m_i2c_write_reg(nfc, 0x30, 0x21, 0x01)) {
    DPRINTF("NFC finalize write failed\n");
  }

  sl_udelay_wait(14000);

  GPIO_PinOutClear(nfc->power.port, nfc->power.pin);
  GPIO_PinModeSet(nfc->SCL.port, nfc->SCL.pin, gpioModeInput, 1);
  GPIO_PinModeSet(nfc->SDA.port, nfc->SDA.pin, gpioModeInput, 1);
  GPIO_PinModeSet(nfc->power.port, nfc->power.pin, gpioModeInput, 1);
}

// Ported from od_nfc_write_ndef_text_en(), generalized from a fixed Text
// record to an arbitrary caller-supplied NDEF message. Writes the AI block
// (preserving the chip's RWFlag) followed by up to 2 data blocks. Chip must
// already be powered and primed (tnb132m_power_up_and_prime()).
static bool tnb132m_write_ndef_blocks(const oepl_efr32xg22_nfcconfig_t* nfc, const uint8_t* ndef_bytes, size_t ndef_len)
{
  uint8_t ai[16] = {0};
  uint8_t cur_ai[16];
  uint8_t blocks[TNB132M_MAX_NDEF_LEN] = {0};
  uint16_t sum = 0;
  size_t need_blocks = (ndef_len + 15) / 16;

  memcpy(blocks, ndef_bytes, ndef_len);

  ai[0] = 0x10; // Ver 1.0
  ai[1] = 0x02; // Nbr = 2 (matches the anchor-cache limit this driver assumes)
  ai[2] = 0x01; // Nbw = 1
  ai[3] = 0x00;
  ai[4] = 0x3C; // Nmaxb, unchanged from the captured boot-time readback
  ai[11] = (uint8_t)((ndef_len >> 16) & 0xFF);
  ai[12] = (uint8_t)((ndef_len >> 8) & 0xFF);
  ai[13] = (uint8_t)(ndef_len & 0xFF);

  // Preserve RWFlag (byte 10) instead of clobbering it: read the AI that's
  // there first, like the reference driver does.
  if(tnb132m_i2c_read16(nfc, 0x48, 0x00, cur_ai) && cur_ai[0] == 0x10) {
    ai[10] = cur_ai[10];
  }

  for(size_t i = 0; i < 14; i++) {
    sum = (uint16_t)(sum + ai[i]);
  }
  ai[14] = (uint8_t)(sum >> 8);
  ai[15] = (uint8_t)(sum & 0xFF);

  if(!tnb132m_i2c_write16(nfc, 0x48, 0x00, ai)) {
    DPRINTF("NFC: AI write failed\n");
    return false;
  }
  sl_udelay_wait(10000);

  for(size_t i = 0; i < need_blocks; i++) {
    if(!tnb132m_i2c_write16(nfc, 0x40, (uint8_t)(0x10 + i * 0x10), &blocks[i * 16])) {
      DPRINTF("NFC: data block %u write failed\n", (unsigned) i);
      return false;
    }
    sl_udelay_wait(10000);
  }

  return true;
}

// TEMPORARY SWD DIAGNOSTIC -- NOT FOR MERGE. Plain globals so a `halt`
// (no reset, so RAM survives) can inspect them via SWD. After one write
// attempt we read back the AI block while the chip is still powered, then
// park the CPU in a busy-loop (never sleeps) instead of returning, so a
// later plain `halt` doesn't hit the EM2/3 debug-clock-gated timeout we saw
// earlier in this session. Symbol addresses (from this exact build,
// arm-none-eabi-nm firmware/out/build/debug/EFR32xG22_OEPL.out):
//   200025a8 b g_nfc_debug_write_ok
//   200025a9 b g_nfc_debug_ai_read_ok
//   200025ac b g_nfc_debug_ai
volatile bool g_nfc_debug_write_ok;
volatile bool g_nfc_debug_ai_read_ok;
volatile uint8_t g_nfc_debug_ai[16];

static bool tnb132m_write_ndef_message(const oepl_efr32xg22_tagconfig_t* tagcfg, const uint8_t* ndef_bytes, size_t ndef_len)
{
  bool ok;

  if(tagcfg == NULL || tagcfg->nfc == NULL) {
    return false;
  }
  if(ndef_len == 0 || ndef_len > TNB132M_MAX_NDEF_LEN) {
    DPRINTF("NFC: NDEF message length %u out of supported range (1..%u)\n", (unsigned) ndef_len, TNB132M_MAX_NDEF_LEN);
    return false;
  }

  if(!tnb132m_power_up_and_prime(tagcfg)) {
    ok = false;
  } else {
    ok = tnb132m_write_ndef_blocks(tagcfg->nfc, ndef_bytes, ndef_len);
  }

  g_nfc_debug_write_ok = ok;
  {
    uint8_t ai_readback[16];
    bool read_ok = tnb132m_i2c_read16(tagcfg->nfc, 0x48, 0x00, ai_readback);
    g_nfc_debug_ai_read_ok = read_ok;
    if(read_ok) {
      memcpy((void*)g_nfc_debug_ai, ai_readback, 16);
    }
  }

  tnb132m_finalize_and_power_down(tagcfg);

  while(1) {
    __asm__ volatile ("nop");
  }

  return ok;
}

bool oepl_hw_nfc_write_url(const uint8_t* url_buffer, size_t length)
{
  // Todo: implement nonblocking I2C driver for NFC
  const oepl_efr32xg22_tagconfig_t* tagcfg = oepl_efr32xg22_get_config();
  if(tagcfg == NULL || tagcfg->nfc == NULL) {
    return false;
  }

  // Wrap into an NFC Forum "URI" well-known record (TNF=0x01, type='U').
  // See the file-header comment above: this path is NOT YET verified on
  // real hardware. Always uses URI identifier code 0x00 (literal, no
  // abbreviation) -- correct but not the most compact encoding.
  if(length > TNB132M_MAX_NDEF_LEN - 5) {
    // 4B NDEF record header + 1B URI ID code must still fit next to the URL
    DPRINTF("NFC: URL too long for TNB132M Nbr=2 cache (max %u chars)\n", TNB132M_MAX_NDEF_LEN - 5);
    return false;
  }

  uint8_t record[TNB132M_MAX_NDEF_LEN];
  size_t plen = 1 + length; // URI ID code + URL bytes

  record[0] = 0xD1; // MB=1 ME=1 CF=0 SR=1 IL=0 TNF=001 (well-known)
  record[1] = 0x01; // type length
  record[2] = (uint8_t) plen;
  record[3] = 0x55; // type = 'U'
  record[4] = 0x00; // URI identifier code: no abbreviation
  memcpy(&record[5], url_buffer, length);

  return tnb132m_write_ndef_message(tagcfg, record, 4 + plen);
}

bool oepl_hw_nfc_write_raw(const uint8_t* raw_buffer, size_t length)
{
  // Todo: implement nonblocking I2C driver for NFC
  const oepl_efr32xg22_tagconfig_t* tagcfg = oepl_efr32xg22_get_config();
  if(tagcfg == NULL || tagcfg->nfc == NULL) {
    return false;
  }

  // The AP is expected to hand us a complete, already-encoded NDEF message
  // (any record type); we place it in the tag's Type-3 data area verbatim
  // and update Ln accordingly. This is the path that has actually been
  // verified against a real NFC reader (as a Well-Known-Text record) -- see
  // the file-header comment above.
  return tnb132m_write_ndef_message(tagcfg, raw_buffer, length);
}

static void deepsleep_timer_cb(sl_sleeptimer_timer_handle_t *handle, void *data)
{
  (void) handle;
  (void) data;
  if(RAIL_GetRadioState(sl_rail_util_get_handle(SL_RAIL_UTIL_HANDLE_INST0)) & RAIL_RF_STATE_IDLE) {
    // Waking up from EM4 will take us through reset, so set all interface pins back to idle state here.
    const oepl_efr32xg22_tagconfig_t* tagconfig = oepl_efr32xg22_get_config();
    if(tagconfig->debug && tagconfig->debug->type == DBG_EUART) {
      GPIO_PinModeSet(tagconfig->debug->output.euart.tx.port, tagconfig->debug->output.euart.tx.pin, gpioModeDisabled, 1);
      if(tagconfig->debug->output.euart.rx.port != gpioPortInvalid) {
        GPIO_PinModeSet(tagconfig->debug->output.euart.rx.port, tagconfig->debug->output.euart.rx.pin, gpioModeDisabled, 1);
      }
      if(tagconfig->debug->output.euart.enable.port != gpioPortInvalid) {
        GPIO_PinModeSet(tagconfig->debug->output.euart.enable.port, tagconfig->debug->output.euart.enable.pin, gpioModeDisabled, 1);
      }
    }

    // Turn off LEDs
    if(tagconfig->led) {
      if(tagconfig->led->white.port != gpioPortInvalid) {
        GPIO_PinModeSet(tagconfig->led->white.port, tagconfig->led->white.pin, gpioModeDisabled, 1);
      }
      if(tagconfig->led->red.port != gpioPortInvalid) {
        GPIO_PinModeSet(tagconfig->led->red.port, tagconfig->led->red.pin, gpioModeDisabled, 1);
      }
      if(tagconfig->led->blue.port != gpioPortInvalid) {
        GPIO_PinModeSet(tagconfig->led->blue.port, tagconfig->led->blue.pin, gpioModeDisabled, 1);
      }
      if(tagconfig->led->green.port != gpioPortInvalid) {
        GPIO_PinModeSet(tagconfig->led->green.port, tagconfig->led->green.pin, gpioModeDisabled, 1);
      }
    }

